postgres_metrics/modified_run_e_postgres_threads_004_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloade -threads 4 -p recordcount=15585 -P ./postgrenosql/conf/postgrenosql.properties
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 7839
[OVERALL], Throughput(ops/sec), 127.56729174639622
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 15
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.19135093761959435
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.19135093761959435
[READ], Operations, 44
[READ], AverageLatency(us), 22661.18181818182
[READ], MinLatency(us), 3120
[READ], MaxLatency(us), 50303
[READ], 95thPercentileLatency(us), 39071
[READ], 99thPercentileLatency(us), 50303
[READ], Return=OK, 44
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 439.75
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 1750
[CLEANUP], 95thPercentileLatency(us), 1750
[CLEANUP], 99thPercentileLatency(us), 1750
[SCAN], Operations, 956
[SCAN], AverageLatency(us), 30021.29079497908
[SCAN], MinLatency(us), 5220
[SCAN], MaxLatency(us), 71935
[SCAN], 95thPercentileLatency(us), 46879
[SCAN], 99thPercentileLatency(us), 56031
[SCAN], Return=OK, 956